# Task-1

Question-1

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("persona.csv")

In [3]:
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

In [5]:
df.describe().T

        count     mean        std   min   25%   50%   75%   max
PRICE  5000.0  34.1320  12.464897   9.0  29.0  39.0  39.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  17.0  21.0  27.0  66.0

In [6]:
df.nunique()

PRICE       6
SOURCE      2
SEX         2
COUNTRY     6
AGE        46
dtype: int64

Question-2

In [7]:
df.groupby("SOURCE").agg({"SOURCE":"count"}).count()

SOURCE    2
dtype: int64

In [8]:
df.groupby("SOURCE").agg({"SOURCE":"count"})

         SOURCE
SOURCE
android    2974
ios        2026

Question-3

In [9]:
df["PRICE"].nunique()

6

Question-4

In [10]:
df.groupby("PRICE").agg({"PRICE":"count"}).rename(columns={"PRICE":"Count"})

       Count
PRICE
9        200
19       992
29      1305
39      1260
49      1031
59       212

Question-5

In [11]:
df.groupby("COUNTRY").agg({"PRICE":"count"}).rename(columns={"PRICE":"Count"})

         Count
COUNTRY
bra       1496
can        230
deu        455
fra        303
tur        451
usa       2065

Question-6

In [12]:
df.groupby("COUNTRY").agg({"PRICE":"sum"}).rename(columns={"PRICE":"Total Price"})

         Total Price
COUNTRY
bra            51354
can             7730
deu            15485
fra            10177
tur            15689
usa            70225

Question-7

In [13]:
df.groupby("SOURCE").agg({"PRICE":"count"}).rename(columns={"PRICE":"Count"})

         Count
SOURCE
android   2974
ios       2026

Question-8

In [14]:
df.groupby("COUNTRY").agg({"PRICE":"mean"}).rename(columns={"PRICE":"Mean Price"})

         Mean Price
COUNTRY
bra       34.327540
can       33.608696
deu       34.032967
fra       33.587459
tur       34.787140
usa       34.007264

Question-9

In [15]:
df.groupby("SOURCE").agg({"PRICE":"mean"}).rename(columns={"PRICE":"Mean Price"})

         Mean Price
SOURCE
android   34.174849
ios       34.069102

Question-10

In [16]:
df.groupby(["COUNTRY","SOURCE"]).agg({"PRICE":"mean"}).rename(columns={"PRICE":"Mean Price"})

                 Mean Price
COUNTRY SOURCE
bra     android   34.387029
        ios       34.222222
can     android   33.330709
        ios       33.951456
deu     android   33.869888
        ios       34.268817
fra     android   34.312500
        ios       32.776224
tur     android   36.229437
        ios       33.272727
usa     android   33.760357
        ios       34.371703

# Task-2

In [17]:
df.groupby(["COUNTRY","SOURCE","SEX","AGE"]).agg({"PRICE":"mean"}).rename(columns={"PRICE":"Mean Price"})

                            Mean Price
COUNTRY SOURCE  SEX    AGE
bra     android female 15    38.714286
                       16    35.944444
                       17    35.666667
                       18    32.255814
                       19    35.206897
...                                ...
usa     ios     male   42    30.250000
                       50    39.000000
                       53    34.000000
                       55    29.000000
                       59    46.500000

[348 rows x 1 columns]

# Task-3

In [18]:
agg_df=df.groupby(["COUNTRY","SOURCE","SEX","AGE"]).agg({"PRICE":"mean"})
agg_df.sort_values(by="PRICE",ascending=False,inplace=True)

In [19]:
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

# Task-4

In [20]:
agg_df=agg_df.reset_index()

In [21]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

# Task-5

In [22]:
def age_cat(age):
    age_list=["0_18", "19_23", "24_30", "31_40", "41_70"]
    if age<19:
        return age_list[0]
    elif age<24:
        return age_list[1] 
    elif age<31:
        return age_list[2]
    elif age<41:
        return age_list[3]
    else:
        return age_list[4]

In [23]:
agg_df["AGE_CAT"]=agg_df["AGE"].apply(age_cat)

In [24]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46   59.0   41_70
1     usa  android    male   36   59.0   31_40
2     fra  android  female   24   59.0   24_30
3     usa      ios    male   32   54.0   31_40
4     deu  android  female   36   49.0   31_40

# Task-6

In [25]:
agg_df["customers_level_based"]=agg_df["COUNTRY"].apply(lambda x: x.upper())+"_"+agg_df["SOURCE"].apply(lambda x: x.upper())+"_"+agg_df["SEX"].apply(lambda x: x.upper())+"_"+agg_df["AGE_CAT"].apply(lambda x: x.upper())

In [26]:
agg_df.groupby("customers_level_based").agg({"PRICE":"mean"}).reset_index()

        customers_level_based      PRICE
0     BRA_ANDROID_FEMALE_0_18  35.645303
1    BRA_ANDROID_FEMALE_19_23  34.077340
2    BRA_ANDROID_FEMALE_24_30  33.863946
3    BRA_ANDROID_FEMALE_31_40  34.898326
4    BRA_ANDROID_FEMALE_41_70  36.737179
..                        ...        ...
104         USA_IOS_MALE_0_18  33.983495
105        USA_IOS_MALE_19_23  34.901872
106        USA_IOS_MALE_24_30  34.838143
107        USA_IOS_MALE_31_40  36.206324
108        USA_IOS_MALE_41_70  35.750000

[109 rows x 2 columns]

# Task-7

In [27]:
agg_df["SEGMENT"]=pd.qcut(agg_df["PRICE"],4,labels=["D","C","B","A"])

In [28]:
agg_df.groupby("SEGMENT").agg({"PRICE":["mean","max","sum"]})

             PRICE
              mean        max          sum
SEGMENT
D        27.302596  31.105263  2375.325850
C        32.933339  34.000000  3128.667165
B        35.436170  37.000000  2870.329792
A        41.434736  59.000000  3521.952577

# Task-8

In [29]:
user1="TUR_ANDROID_FEMALE_31_40"
user2="FRA_IOS_FEMALE_31_40"

In [30]:
agg_df[agg_df["customers_level_based"]==user1].groupby("SEGMENT").agg({"SEGMENT":"count","PRICE":"mean"}).dropna().drop("SEGMENT",axis=1).reset_index().rename(columns={"PRICE":"Mean Price"})

  SEGMENT  Mean Price
0       A   41.833333

In [31]:
agg_df[agg_df["customers_level_based"]==user2].groupby("SEGMENT").agg({"SEGMENT":"count","PRICE":"mean"}).dropna().drop("SEGMENT",axis=1).reset_index().rename(columns={"PRICE":"Mean Price"})

  SEGMENT  Mean Price
0       C   32.818182